Revit 2024 API
StructuralSectionGeneralLA Class
 Defines parameters for Angle Cold Formed structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralSectionGeneralLA : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionGeneralLA _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionGeneralLA : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralLA
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfileWithLips
See Also
StructuralSectionGeneralLA Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace